src/data_analysis/collected_data/mango/api/standarda4v2/a/load_read.txt
Running 60m test @ http://13.87.88.19:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 1076.173ms, rate sampling interval: 5029ms
  Thread calibration: mean lat.: 1078.401ms, rate sampling interval: 5062ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.44m     9.87m   38.59m    60.73%
    Req/Sec   192.39     39.26   239.00     83.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.67m 
 75.000%   28.59m 
 90.000%   33.66m 
 99.000%   38.59m 
 99.900%   40.89m 
 99.990%   42.61m 
 99.999%   43.24m 
100.000%   43.69m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     519.423     0.000000            1         1.00
  429916.159     0.100000       138647         1.11
  642252.799     0.200000       277001         1.25
  846200.831     0.300000       415679         1.43
 1047003.135     0.400000       554058         1.67
 1240465.407     0.500000       692376         2.00
 1333788.671     0.550000       761641         2.22
 1430257.663     0.600000       831409         2.50
 1524629.503     0.650000       900592         2.86
 1620049.919     0.700000       969333         3.33
 1715470.335     0.750000      1038564         4.00
 1764753.407     0.775000      1073266         4.44
 1814036.479     0.800000      1108233         5.00
 1864368.127     0.825000      1142836         5.71
 1913651.199     0.850000      1177047         6.67
 1965031.423     0.875000      1211797         8.00
 1992294.399     0.887500      1229565         8.89
 2019557.375     0.900000      1246748        10.00
 2046820.351     0.912500      1263545        11.43
 2077229.055     0.925000      1281048        13.33
 2108686.335     0.937500      1298292        16.00
 2125463.551     0.943750      1306793        17.78
 2144337.919     0.950000      1315913        20.00
 2164260.863     0.956250      1324458        22.86
 2185232.383     0.962500      1333186        26.67
 2208301.055     0.968750      1341957        32.00
 2220883.967     0.971875      1346459        35.56
 2233466.879     0.975000      1350693        40.00
 2246049.791     0.978125      1354525        45.71
 2262827.007     0.981250      1359129        53.33
 2279604.223     0.984375      1363462        64.00
 2287992.831     0.985938      1365449        71.11
 2298478.591     0.987500      1367766        80.00
 2308964.351     0.989062      1369908        91.43
 2319450.111     0.990625      1371877       106.67
 2332033.023     0.992188      1373936       128.00
 2340421.631     0.992969      1375097       142.22
 2348810.239     0.993750      1376210       160.00
 2357198.847     0.994531      1377305       182.86
 2365587.455     0.995313      1378217       213.33
 2378170.367     0.996094      1379266       256.00
 2386558.975     0.996484      1379908       284.44
 2392850.431     0.996875      1380451       320.00
 2399141.887     0.997266      1380894       365.71
 2409627.647     0.997656      1381489       426.67
 2420113.407     0.998047      1382063       512.00
 2426404.863     0.998242      1382320       568.89
 2430599.167     0.998437      1382513       640.00
 2438987.775     0.998633      1382808       731.43
 2447376.383     0.998828      1383107       853.33
 2455764.991     0.999023      1383366      1024.00
 2459959.295     0.999121      1383473      1137.78
 2466250.751     0.999219      1383605      1280.00
 2474639.359     0.999316      1383755      1462.86
 2480930.815     0.999414      1383888      1706.67
 2489319.423     0.999512      1384005      2048.00
 2493513.727     0.999561      1384060      2275.56
 2499805.183     0.999609      1384143      2560.00
 2506096.639     0.999658      1384211      2925.71
 2512388.095     0.999707      1384271      3413.33
 2520776.703     0.999756      1384329      4096.00
 2527068.159     0.999780      1384377      4551.11
 2533359.615     0.999805      1384413      5120.00
 2537553.919     0.999829      1384436      5851.43
 2545942.527     0.999854      1384473      6826.67
 2550136.831     0.999878      1384500      8192.00
 2552233.983     0.999890      1384522      9102.22
 2556428.287     0.999902      1384545     10240.00
 2558525.439     0.999915      1384559     11702.86
 2562719.743     0.999927      1384572     13653.33
 2564816.895     0.999939      1384591     16384.00
 2564816.895     0.999945      1384591     18204.44
 2566914.047     0.999951      1384600     20480.00
 2569011.199     0.999957      1384619     23405.71
 2569011.199     0.999963      1384619     27306.67
 2573205.503     0.999969      1384635     32768.00
 2573205.503     0.999973      1384635     36408.89
 2573205.503     0.999976      1384635     40960.00
 2575302.655     0.999979      1384640     46811.43
 2577399.807     0.999982      1384643     54613.33
 2581594.111     0.999985      1384646     65536.00
 2583691.263     0.999986      1384649     72817.78
 2589982.719     0.999988      1384651     81920.00
 2594177.023     0.999989      1384654     93622.86
 2598371.327     0.999991      1384656    109226.67
 2600468.479     0.999992      1384661    131072.00
 2600468.479     0.999993      1384661    145635.56
 2600468.479     0.999994      1384661    163840.00
 2600468.479     0.999995      1384661    187245.71
 2600468.479     0.999995      1384661    218453.33
 2604662.783     0.999996      1384662    262144.00
 2610954.239     0.999997      1384663    291271.11
 2610954.239     0.999997      1384663    327680.00
 2619342.847     0.999997      1384666    374491.43
 2619342.847     0.999998      1384666    436906.67
 2619342.847     0.999998      1384666    524288.00
 2619342.847     0.999998      1384666    582542.22
 2619342.847     0.999998      1384666    655360.00
 2619342.847     0.999999      1384666    748982.86
 2619342.847     0.999999      1384666    873813.33
 2619342.847     0.999999      1384666   1048576.00
 2619342.847     0.999999      1384666   1165084.44
 2619342.847     0.999999      1384666   1310720.00
 2621439.999     0.999999      1384667   1497965.71
 2621439.999     1.000000      1384667          inf
#[Mean    =  1226230.520, StdDeviation   =   592453.414]
#[Max     =  2619342.848, Total count    =      1384667]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1390542 requests in 60.00m, 16.88GB read
  Socket errors: connect 0, read 532, write 3747, timeout 244263
  Non-2xx or 3xx responses: 101880
Requests/sec:    386.26
Transfer/sec:      4.80MB